Suprita1801/MSP430---1142/Final Project/smartgym_complete.c
/*
 * ═══════════════════════════════════════════════════════════════
 *  SmartGym Monitor — COMPLETE FINAL CODE
 *
 *  Components:
 *  1. 5 Push Buttons   (Entry, Exit, Mode, Confirm, Emergency)
 *  2. I2C LCD 16x2     (PCF8574 backpack)
 *  3. Buzzer           (3-pin active-LOW module)
 *  4. Session Timer    (TimerA software prescaler)
 *  5. TMP36            (Temperature sensor)
 *  6. HC-SR501 PIR     (Motion sensor via voltage divider)
 *  7. HM-10 BLE        (Bluetooth to LightBlue app)
 *  8. CP2102           (Debug UART — kept for verification)
 *
 *  Target  : MSP430G2553
 *  Clock   : 16 MHz DCO (calibrated)
 * ═══════════════════════════════════════════════════════════════
 *
 * COMPLETE PIN MAP
 * ───────────────────────────────────────────────────────────────
 *  PIN    COMPONENT          NOTES
 *  P1.0   TMP36 VOUT         ADC A0
 *  P1.1   CP2102 TXD         MSP RX  — debug UART
 *  P1.2   CP2102 RXD         MSP TX  — debug UART
 *  P1.3   Entry Button       → GND   (pull-up)
 *  P1.4   Exit  Button       → 3.3V  (pull-down)
 *  P1.5   Buzzer I/O         3-pin active-LOW
 *  P1.6   PIR ECHI           via 10kΩ/20kΩ voltage divider
 *  P2.0   Mode Button        → GND   (pull-up)
 *  P2.1   Confirm Button     → GND   (pull-up)
 *  P2.2   Emergency Button   → GND   (pull-up)
 *  P2.3   LCD SDA            Software I2C
 *  P2.4   LCD SCL            Software I2C
 *  P2.5   HM-10 RXD          Software UART TX → BLE
 *
 * BUZZER  VCC→3.3V  I/O→P1.5  GND→GND  (active-LOW)
 * TMP36   VCC→3.3V  OUT→P1.0  GND→GND
 * PIR     VCC→5V(Arduino)  ECHI→10k→[junction+P1.6]→20k→GND
 * HM-10   VCC→3.3V  GND→GND  RXD→P2.5  TXD→unconnected
 *
 * SESSION DURATIONS
 * ───────────────────────────────────────────────────────────────
 *  CARDIO : 20 min | warn 60s left  | 5 min rest
 *  UPPER  : 10 min | 5+5 sides      | warn 4 min left | 3 min rest
 *  LOWER  : 15 min | warn 60s left  | 3 min rest
 *
 * TEMPERATURE
 * ───────────────────────────────────────────────────────────────
 *  < 20°C  → COLD!
 *  20-25°C → GOOD
 *  > 25°C  → TURN ON AC
 *
 * BLUETOOTH MESSAGES (LightBlue app FFE1 characteristic)
 * ───────────────────────────────────────────────────────────────
 *  ENTRY|IN_GYM
 *  EXIT|IDLE
 *  MODE:CARDIO
 *  MODE:UPPER
 *  MODE:LOWER
 *  SESSION:ACTIVE
 *  WARN:60S
 *  REST:START
 *  REST:DONE
 *  TEMP:24C|GOOD
 *  TEMP:28C|ON AC
 *  TEMP:18C|COLD
 *  PIR:OK
 *  PIR:ALERT 30S
 *  EMERGENCY!!
 * ═══════════════════════════════════════════════════════════════
 */

#include <msp430.h>
#include "lcd_i2c.h"
#include <stdint.h>

/* ════════════════════════════════════════════════════
 *  PIN DEFINES
 * ════════════════════════════════════════════════════ */
#define BUZZER_PIN      BIT5
#define BUZZER_ON()     (P1OUT &= ~BUZZER_PIN)  /* active-LOW ON      */
#define BUZZER_OFF()    (P1OUT |=  BUZZER_PIN)  /* active-LOW OFF     */

#define PIR_PIN         BIT6            /* P1.6                       */
#define BLE_TX_PIN      BIT5            /* P2.5 → HM-10 RXD          */

#define BTN_ENTRY       BIT3            /* P1.3 pull-up  active-LOW   */
#define BTN_EXIT        BIT4            /* P1.4 pull-down active-HIGH */
#define BTN_MODE        BIT0            /* P2.0 pull-up  active-LOW   */
#define BTN_CONFIRM     BIT1            /* P2.1 pull-up  active-LOW   */
#define BTN_EMERGENCY   BIT2            /* P2.2 pull-up  active-LOW   */

/* ════════════════════════════════════════════════════
 *  TIMING
 * ════════════════════════════════════════════════════ */
#define DELAY_MS(x)     __delay_cycles((long)(16000UL * (x)))
#define DEBOUNCE        800000UL
#define TIMER_CCR0      49999           /* 25ms per ISR at 2MHz       */
#define TICKS_PER_SEC   40              /* 40 × 25ms = 1 second       */
#define BIT_CYCLES      1666            /* 16MHz / 9600 baud          */

/* ════════════════════════════════════════════════════
 *  SESSION DURATIONS (seconds)
 * ════════════════════════════════════════════════════ */
#define CARDIO_SESSION  (20 * 60)
#define CARDIO_REST     (5  * 60)
#define CARDIO_WARN     60

#define UPPER_SESSION   (10 * 60)
#define UPPER_HALF      (5  * 60)
#define UPPER_REST      (3  * 60)
#define UPPER_WARN      (4  * 60)

#define LOWER_SESSION   (10 * 60)    /* 5 min left + 5 min right   */
#define LOWER_HALF      (5  * 60)    /* switch side at 5 min       */
#define LOWER_REST      (3  * 60)
#define LOWER_WARN      (4  * 60)   /* warn at 4 min left         */

/* ════════════════════════════════════════════════════
 *  TEMPERATURE THRESHOLDS
 * ════════════════════════════════════════════════════ */
#define TEMP_NORMAL_LOW     20
#define TEMP_NORMAL_HIGH    25
#define TEMP_READ_INTERVAL  10

/* ════════════════════════════════════════════════════
 *  PIR
 * ════════════════════════════════════════════════════ */
#define PIR_NO_MOTION_LIMIT 30

/* ════════════════════════════════════════════════════
 *  TYPES
 * ════════════════════════════════════════════════════ */
typedef enum { MODE_CARDIO=0, MODE_UPPER=1, MODE_LOWER=2 } WorkoutMode;

typedef enum {
    STATE_IDLE=0,
    STATE_MODE_SELECT,
    STATE_ACTIVE,
    STATE_WARNING,
    STATE_REST,
    STATE_EMERGENCY
} GymState;

/* ════════════════════════════════════════════════════
 *  GLOBALS
 * ════════════════════════════════════════════════════ */
volatile GymState    gymState      = STATE_IDLE;
volatile WorkoutMode currentMode   = MODE_CARDIO;
volatile uint8_t     modeConfirmed = 0;

/* Timer */
volatile uint8_t  timerSubTick   = 0;
volatile uint8_t  timerTick      = 0;
volatile uint16_t sessionSeconds = 0;
volatile uint16_t sessionLimit   = 0;
volatile uint16_t warnSeconds    = 0;
volatile uint16_t restSeconds    = 0;
volatile uint16_t restLimit      = 0;
volatile uint8_t  warnBeepTick   = 0;
volatile uint8_t  upperHalfDone  = 0;

/* Temperature */
volatile uint8_t  tempReadCounter = 0;
volatile uint8_t  tempReadFlag    = 0;
         int16_t  lastTempC       = 0;

/* PIR */
volatile uint16_t pirNoMotionCount = 0;
volatile uint8_t  pirAlertSent     = 0;

