Suprita1801/MSP430---1142/Final Project/smartgym_complete.c
/* ISR flags */
volatile uint8_t entryFlag     = 0;
volatile uint8_t exitFlag      = 0;
volatile uint8_t modeFlag      = 0;
volatile uint8_t confirmFlag   = 0;
volatile uint8_t emergencyFlag = 0;

/* ════════════════════════════════════════════════════
 *  DEBUG UART — CP2102 (hardware UART UCA0)
 * ════════════════════════════════════════════════════ */
void uart_init(void)
{
    P1SEL  |= BIT1 + BIT2;
    P1SEL2 |= BIT1 + BIT2;
    UCA0CTL1 |= UCSSEL_2;
    UCA0BR0   = 0x82;
    UCA0BR1   = 0x06;
    UCA0MCTL  = UCBRS_6;
    UCA0CTL1 &= ~UCSWRST;
}

void uart_send_char(char c)
{
    while (!(IFG2 & UCA0TXIFG));
    UCA0TXBUF = c;
}

void uart_print(const char *str)
{
    while (*str) uart_send_char(*str++);
}

void uart_print_int(int16_t n)
{
    char buf[6];
    uint8_t i = 0;
    if (n < 0) { uart_send_char('-'); n = -n; }
    if (n == 0) { uart_send_char('0'); return; }
    while (n > 0) { buf[i++] = '0' + (n % 10); n /= 10; }
    while (i--) uart_send_char(buf[i]);
}

/* ════════════════════════════════════════════════════
 *  BLUETOOTH UART — HM-10 (software UART P2.5)
 * ════════════════════════════════════════════════════ */
void ble_init(void)
{
    P2DIR |=  BLE_TX_PIN;
    P2OUT |=  BLE_TX_PIN;       /* idle HIGH                          */
}

void ble_send_byte(uint8_t byte)
{
    uint8_t i;

    /* Start bit */
    P2OUT &= ~BLE_TX_PIN;
    __delay_cycles(BIT_CYCLES);

    /* 8 data bits LSB first */
    for (i = 0; i < 8; i++)
    {
        if (byte & 0x01) P2OUT |=  BLE_TX_PIN;
        else             P2OUT &= ~BLE_TX_PIN;
        __delay_cycles(BIT_CYCLES);
        byte >>= 1;
    }

    /* Stop bit */
    P2OUT |= BLE_TX_PIN;
    __delay_cycles(BIT_CYCLES);
}

void ble_print(const char *str)
{
    while (*str) ble_send_byte(*str++);
}

void ble_println(const char *str)
{
    ble_print(str);
    ble_send_byte('\r');
    ble_send_byte('\n');
}

void ble_print_int(int16_t n)
{
    char buf[6];
    uint8_t i = 0;
    if (n < 0) { ble_send_byte('-'); n = -n; }
    if (n == 0) { ble_send_byte('0'); return; }
    while (n > 0) { buf[i++] = '0' + (n % 10); n /= 10; }
    while (i--) ble_send_byte(buf[i]);
}

/*
 * Send same message to both CP2102 and HM-10
 * Use this for all notifications so trainer
 * sees everything on LightBlue
 */
void notify(const char *str)
{
    uart_print(str);
    uart_print("\r\n");
    ble_println(str);
}

void notify_temp(int16_t t, const char *status)
{
    /* CP2102 */
    uart_print("TEMP:");
    uart_print_int(t);
    uart_print("C|");
    uart_print(status);
    uart_print("\r\n");

    /* HM-10 */
    ble_print("TEMP:");
    ble_print_int(t);
    ble_print("C|");
    ble_println(status);
}

/* ════════════════════════════════════════════════════
 *  ADC10 — TMP36
 * ════════════════════════════════════════════════════ */
void adc_init(void)
{
    ADC10CTL1 = INCH_0;
    ADC10CTL0 = SREF_0 | ADC10SHT_3 | ADC10ON;
    ADC10AE0  = BIT0;
}

int16_t adc_read_temp(void)
{
    int32_t vout_mv;
    ADC10CTL0 |= ENC | ADC10SC;
    while (ADC10CTL1 & ADC10BUSY);
    vout_mv = ((int32_t)ADC10MEM * 3300) / 1023;
    return (int16_t)((vout_mv - 500) / 10);
}

/* ════════════════════════════════════════════════════
 *  BUZZER
 * ════════════════════════════════════════════════════ */
void buzzer_init(void)
{
    P1DIR |=  BUZZER_PIN;
    P1OUT |=  BUZZER_PIN;       /* HIGH = OFF active-LOW              */
}

void buzzer_entry(void)         /* pip pip */
{
    BUZZER_ON();  DELAY_MS(100);
    BUZZER_OFF(); DELAY_MS(80);
    BUZZER_ON();  DELAY_MS(100);
    BUZZER_OFF();
}

void buzzer_exit(void)          /* long beep */
{
    BUZZER_ON();  DELAY_MS(600);
    BUZZER_OFF();
}

void buzzer_mode(void)          /* tick */
{
    BUZZER_ON();  DELAY_MS(40);
    BUZZER_OFF();
}

void buzzer_confirm(void)       /* pip pip BEEP */
{
    BUZZER_ON();  DELAY_MS(80);
    BUZZER_OFF(); DELAY_MS(60);
    BUZZER_ON();  DELAY_MS(120);
    BUZZER_OFF(); DELAY_MS(60);
    BUZZER_ON();  DELAY_MS(300);
    BUZZER_OFF();
}

void buzzer_warn(void)          /* 3 slow beeps */
{
    BUZZER_ON();  DELAY_MS(200);
    BUZZER_OFF(); DELAY_MS(100);
    BUZZER_ON();  DELAY_MS(200);
    BUZZER_OFF(); DELAY_MS(100);
    BUZZER_ON();  DELAY_MS(200);
    BUZZER_OFF();
}

void buzzer_temp_alert(void)    /* 2 fast beeps */
{
    BUZZER_ON();  DELAY_MS(100);
    BUZZER_OFF(); DELAY_MS(60);
    BUZZER_ON();  DELAY_MS(100);
    BUZZER_OFF();
}

void buzzer_rest_start(void)    /* double beep */
{
    BUZZER_ON();  DELAY_MS(200);
    BUZZER_OFF(); DELAY_MS(100);
    BUZZER_ON();  DELAY_MS(200);
    BUZZER_OFF();
}

void buzzer_rest_end(void)      /* triple beep */
{
    BUZZER_ON();  DELAY_MS(150);
    BUZZER_OFF(); DELAY_MS(80);
    BUZZER_ON();  DELAY_MS(150);
    BUZZER_OFF(); DELAY_MS(80);
    BUZZER_ON();  DELAY_MS(150);
    BUZZER_OFF();
}

void buzzer_pir_alert(void)     /* 4 long pulses */
{
    uint8_t i;
    for (i = 0; i < 4; i++)
    {
        BUZZER_ON();  DELAY_MS(400);
        BUZZER_OFF(); DELAY_MS(200);
    }
}

void buzzer_emergency(void)     /* rapid continuous */
{
    uint8_t i;
    for (i = 0; i < 8; i++)
    {
        BUZZER_ON();  DELAY_MS(80);
        BUZZER_OFF(); DELAY_MS(50);
    }
}

/* ════════════════════════════════════════════════════
 *  TIMER — SMCLK/8=2MHz, CCR0=49999 → 25ms ISR × 40 = 1s
 * ════════════════════════════════════════════════════ */
void timer_init(void)
{
    TA0CTL   = TASSEL_2 | ID_3 | MC_0;
    TA0CCR0  = TIMER_CCR0;
    TA0CCTL0 = CCIE;
}

void timer_start(void)
{
    timerSubTick = 0;
    TA0CTL |= MC_1;
}

void timer_stop(void)
{
    TA0CTL &= ~MC_3;
}

/* ════════════════════════════════════════════════════
 *  PIR
 * ════════════════════════════════════════════════════ */
void pir_init(void)
{
    P1DIR &= ~PIR_PIN;
    P1REN &= ~PIR_PIN;
}

uint8_t pir_detected(void)
{
    return (P1IN & PIR_PIN) ? 1 : 0;
}

/* ════════════════════════════════════════════════════
 *  LCD HELPERS
 * ════════════════════════════════════════════════════ */
void lcd_print_padded(const char *str)
{
    uint8_t i = 0;
    while (str[i] && i < 16) { LCD_printChar(str[i]); i++; }
    while (i < 16)            { LCD_printChar(' ');    i++; }
}

void lcd_show(const char *line1, const char *line2)
{
    LCD_setCursor(0, 0); lcd_print_padded(line1);
    LCD_setCursor(0, 1); lcd_print_padded(line2);
}

void lcd_show_mode_select(WorkoutMode m)
{
    LCD_setCursor(0, 0); lcd_print_padded("SELECT MODE:    ");
    LCD_setCursor(0, 1);
    switch (m)
    {
        case MODE_CARDIO: lcd_print_padded("> CARDIO        "); break;
        case MODE_UPPER:  lcd_print_padded("> UPPER BODY    "); break;
        case MODE_LOWER:  lcd_print_padded("> LEG TRAIN     "); break;
    }
}

void lcd_print_time(uint16_t total_seconds)
{
    uint8_t mins = total_seconds / 60;
    uint8_t secs = total_seconds % 60;
    LCD_printChar('0' + (mins / 10));
    LCD_printChar('0' + (mins % 10));
    LCD_printChar(':');
    LCD_printChar('0' + (secs / 10));
    LCD_printChar('0' + (secs % 10));
}

void lcd_print_temp(int16_t t)
{
    /* Display as "17 C" — space between number and C for clarity */
    if (t < 0) { LCD_printChar('-'); t = -t; }
    if (t >= 100) LCD_printChar('0' + (t / 100));
    LCD_printChar('0' + ((t % 100) / 10));
    LCD_printChar('0' + (t % 10));
    LCD_printChar(' ');
    LCD_printChar('C');
}

