Suprita1801/MSP430---1142/Final Project/smartgym_complete.c
void lcd_show_temp_idle(int16_t t)
{
    /* Format: "TEMP:24 C  GOOD " — 16 chars total */
    LCD_setCursor(0, 1);
    LCD_print("TEMP:");
    lcd_print_temp(t);
    if      (t > TEMP_NORMAL_HIGH) LCD_print(" ON AC");
    else if (t < TEMP_NORMAL_LOW)  LCD_print(" COLD!");
    else                           LCD_print("  GOOD");
    LCD_print(" ");
}

void lcd_show_temp_alert(int16_t t)
{
    /* Format: "TEMP:28 C  ON AC" */
    LCD_setCursor(0, 1);
    LCD_print("TEMP:");
    lcd_print_temp(t);
    if (t > TEMP_NORMAL_HIGH) LCD_print(" ON AC");
    else                      LCD_print(" COLD!");
}

void lcd_update_session(void)
{
    uint16_t remaining = sessionLimit - sessionSeconds;

    LCD_setCursor(0, 0);
    switch (currentMode)
    {
        case MODE_CARDIO: LCD_print("CARDIO "); break;
        case MODE_UPPER:  LCD_print("UPPER  "); break;
        case MODE_LOWER:  LCD_print("LOWER  "); break;
    }
    lcd_print_time(sessionSeconds);
    LCD_print("   ");

    LCD_setCursor(0, 1);
    if (gymState == STATE_WARNING)
    {
        LCD_print("!WARN ");
        lcd_print_time(remaining);
        LCD_print("   ");
    }
    else
    {
        LCD_print("LEFT  ");
        lcd_print_time(remaining);
        LCD_print("   ");
    }
}

void lcd_update_rest(void)
{
    LCD_setCursor(0, 0); lcd_print_padded("  REST PERIOD   ");
    LCD_setCursor(0, 1);
    LCD_print("REST  ");
    lcd_print_time(restSeconds);
    LCD_print("   ");
}

/* ════════════════════════════════════════════════════
 *  TEMPERATURE HANDLER
 * ════════════════════════════════════════════════════ */
void handle_temperature(void)
{
    lastTempC = adc_read_temp();

    if (lastTempC > TEMP_NORMAL_HIGH)
    {
        notify_temp(lastTempC, "ON AC");
        if (gymState == STATE_ACTIVE || gymState == STATE_WARNING)
        {
            buzzer_temp_alert();
            lcd_show_temp_alert(lastTempC);
            DELAY_MS(3000);
            lcd_update_session();
        }
        else if (gymState == STATE_REST)
        {
            buzzer_temp_alert();
            lcd_show_temp_alert(lastTempC);
            DELAY_MS(3000);
            lcd_update_rest();
        }
        else if (gymState == STATE_IDLE)
        {
            lcd_show_temp_idle(lastTempC);
        }
    }
    else if (lastTempC < TEMP_NORMAL_LOW)
    {
        notify_temp(lastTempC, "COLD");
        if (gymState == STATE_IDLE)
            lcd_show_temp_idle(lastTempC);
    }
    else
    {
        notify_temp(lastTempC, "GOOD");
        if (gymState == STATE_IDLE)
            lcd_show_temp_idle(lastTempC);
    }
}

/* ════════════════════════════════════════════════════
 *  SESSION HELPERS
 * ════════════════════════════════════════════════════ */
void session_start(WorkoutMode m)
{
    sessionSeconds   = 0;
    warnBeepTick     = 0;
    tempReadCounter  = 0;
    pirNoMotionCount = 0;
    pirAlertSent     = 0;
    upperHalfDone    = 0;
    lowerHalfDone    = 0;

    switch (m)
    {
        case MODE_CARDIO:
            sessionLimit = CARDIO_SESSION;
            restLimit    = CARDIO_REST;
            warnSeconds  = CARDIO_WARN;
            break;
        case MODE_UPPER:
            sessionLimit = UPPER_SESSION;
            restLimit    = UPPER_REST;
            warnSeconds  = UPPER_WARN;
            break;
        case MODE_LOWER:
            sessionLimit = LOWER_SESSION;
            restLimit    = LOWER_REST;
            warnSeconds  = LOWER_WARN;  /* warn at 4 min left         */
            break;
    }

    gymState = STATE_ACTIVE;
    timer_start();
    lcd_update_session();
    notify("SESSION:ACTIVE");
}

void rest_start(void)
{
    restSeconds = restLimit;
    gymState    = STATE_REST;
    buzzer_rest_start();
    lcd_update_rest();
    notify("REST:START");
}

void reset_to_idle(void)
{
    timer_stop();
    gymState       = STATE_IDLE;
    modeConfirmed  = 0;
    currentMode    = MODE_CARDIO;
    sessionSeconds = 0;
}

/* ════════════════════════════════════════════════════
 *  BUTTON INIT
 * ════════════════════════════════════════════════════ */
void buttons_init(void)
{
    P1DIR &= ~BTN_ENTRY;  P1REN |= BTN_ENTRY;  P1OUT |=  BTN_ENTRY;
    P1IES |=  BTN_ENTRY;  P1IFG &= ~BTN_ENTRY; P1IE  |=  BTN_ENTRY;

    P1DIR &= ~BTN_EXIT;   P1REN |= BTN_EXIT;   P1OUT &= ~BTN_EXIT;
    P1IES &= ~BTN_EXIT;   P1IFG &= ~BTN_EXIT;  P1IE  |=  BTN_EXIT;

    P2DIR &= ~BTN_MODE;      P2REN |= BTN_MODE;      P2OUT |=  BTN_MODE;
    P2IES |=  BTN_MODE;      P2IFG &= ~BTN_MODE;     P2IE  |=  BTN_MODE;

    P2DIR &= ~BTN_CONFIRM;   P2REN |= BTN_CONFIRM;   P2OUT |=  BTN_CONFIRM;
    P2IES |=  BTN_CONFIRM;   P2IFG &= ~BTN_CONFIRM;  P2IE  |=  BTN_CONFIRM;

    P2DIR &= ~BTN_EMERGENCY; P2REN |= BTN_EMERGENCY; P2OUT |=  BTN_EMERGENCY;
    P2IES |=  BTN_EMERGENCY; P2IFG &= ~BTN_EMERGENCY;P2IE  |=  BTN_EMERGENCY;
}

/* ════════════════════════════════════════════════════
 *  MAIN
 * ════════════════════════════════════════════════════ */
void main(void)
{
    WDTCTL = WDTPW | WDTHOLD;

    /* Buzzer OFF before clock init */
    P1DIR = BUZZER_PIN;
    P1OUT = BUZZER_PIN;

    BCSCTL1 = CALBC1_16MHZ;
    DCOCTL  = CALDCO_16MHZ;

    /* Software I2C idle HIGH */
    P2DIR |= BIT3 + BIT4;
    P2OUT |= BIT3 + BIT4;

    uart_init();
    ble_init();
    adc_init();
    buzzer_init();
    pir_init();
    timer_init();
    LCD_init();
    LCD_clear();
    buttons_init();

    __bis_SR_register(GIE);

    /* Read temp at startup */
    lastTempC = adc_read_temp();

    /* Startup screens */
    LCD_setCursor(0, 0); lcd_print_padded("  SMARTGYM MON  ");
    lcd_show_temp_idle(lastTempC);

    notify("=== SmartGym Monitor FINAL ===");
    notify("All systems ready");

    /* ══════════════════════════════════════════════
     *  MAIN LOOP
     * ══════════════════════════════════════════════ */
    while (1)
    {
        /* ── Temperature read ── */
        if (tempReadFlag)
        {
            tempReadFlag = 0;
            handle_temperature();
        }

        /* ── 1-second tick ── */
        if (timerTick)
        {
            timerTick = 0;

            /* Temperature counter */
            tempReadCounter++;
            if (tempReadCounter >= TEMP_READ_INTERVAL)
            {
                tempReadCounter = 0;
                tempReadFlag    = 1;
            }

            /* ── Active / Warning ── */
            if (gymState == STATE_ACTIVE || gymState == STATE_WARNING)
            {
                sessionSeconds++;
                uint16_t remaining = sessionLimit - sessionSeconds;

