Suprita1801/MSP430---1142/Final Project/smartgym_complete.c
                /* Upper body side switch at 5 min */
                if (currentMode == MODE_UPPER    &&
                    sessionSeconds == UPPER_HALF &&
                    !upperHalfDone)
                {
                    upperHalfDone = 1;
                    buzzer_warn();
                    LCD_setCursor(0, 1);
                    lcd_print_padded("SWITCH SIDE NOW!");
                    notify("UPPER:SWITCH SIDE");
                    DELAY_MS(2000);
                }

                /* Lower body side switch at 5 min */
                if (currentMode == MODE_LOWER    &&
                    sessionSeconds == LOWER_HALF &&
                    !lowerHalfDone)
                {
                    lowerHalfDone = 1;
                    buzzer_warn();
                    LCD_setCursor(0, 1);
                    lcd_print_padded("SWITCH LEG NOW! ");
                    notify("LOWER:SWITCH LEG");
                    DELAY_MS(2000);
                }

                /* Enter WARNING */
                if (remaining == warnSeconds && gymState == STATE_ACTIVE)
                {
                    gymState     = STATE_WARNING;
                    warnBeepTick = 0;
                    buzzer_warn();
                    notify("WARN:TIME ALMOST UP");
                }

                /* Warning beep every 10s */
                if (gymState == STATE_WARNING)
                {
                    warnBeepTick++;
                    if (warnBeepTick >= 10)
                    {
                        warnBeepTick = 0;
                        buzzer_warn();
                    }
                }

                /* PIR motion check */
                if (pir_detected())
                {
                    /* Motion seen — reset counter */
                    if (pirNoMotionCount > 5)
                    {
                        /* Only update LCD if we were in no-motion state */
                        lcd_update_session();
                    }
                    pirNoMotionCount = 0;
                    pirAlertSent     = 0;
                }
                else
                {
                    pirNoMotionCount++;

                    /* Show live no-motion counter on LCD line 2 */
                    if (pirNoMotionCount >= 5 && pirNoMotionCount < PIR_NO_MOTION_LIMIT)
                    {
                        LCD_setCursor(0, 1);
                        LCD_print("NO MOV ");
                        uint8_t s = (uint8_t)pirNoMotionCount;
                        LCD_printChar('0' + (s / 10));
                        LCD_printChar('0' + (s % 10));
                        LCD_print("s LEFT  ");
                    }

                    if (pirNoMotionCount >= PIR_NO_MOTION_LIMIT && !pirAlertSent)
                    {
                        pirAlertSent = 1;
                        buzzer_pir_alert();
                        LCD_setCursor(0, 1);
                        lcd_print_padded("NO MOTION DETCT!");
                        notify("PIR:NO MOTION 30S ALERT");
                        DELAY_MS(3000);
                        lcd_update_session();
                        pirNoMotionCount = 0;
                    }
                }

                /* Session complete */
                if (sessionSeconds >= sessionLimit)
                {
                    timer_stop();
                    rest_start();
                }
                else
                {
                    lcd_update_session();

                    /*
                     * PIR live status on Line 2 every 5 seconds
                     * Only during ACTIVE (not WARNING — warn uses Line 2)
                     * Shows "PIR: MOTION OK " or "PIR: NO MOTION "
                     * for 1 second then returns to time display
                     */
                    if (gymState == STATE_ACTIVE && (sessionSeconds % 5 == 0))
                    {
                        LCD_setCursor(0, 1);
                        if (pir_detected())
                            lcd_print_padded("PIR: MOTION OK  ");
                        else
                            lcd_print_padded("PIR: NO MOTION  ");
                        DELAY_MS(1000);
                        lcd_update_session();
                    }
                }
            }

            /* ── Rest countdown ── */
            else if (gymState == STATE_REST)
            {
                if (restSeconds > 0) restSeconds--;

                if (restSeconds == 0)
                {
                    gymState = STATE_IDLE;
                    buzzer_rest_end();
                    LCD_setCursor(0, 0); lcd_print_padded("  REST COMPLETE ");
                    lcd_show_temp_idle(lastTempC);
                    notify("REST:DONE|PRESS ENTRY");
                }
                else
                {
                    lcd_update_rest();
                }
            }

            /* ── IDLE: refresh temp ── */
            else if (gymState == STATE_IDLE)
            {
                lcd_show_temp_idle(lastTempC);
            }
        }

        /* ══ BUTTON HANDLERS ════════════════════════ */

        /* EMERGENCY */
        if (emergencyFlag)
        {
            emergencyFlag = 0;
            timer_stop();
            gymState      = STATE_EMERGENCY;
            modeConfirmed = 0;

            lcd_show("!! EMERGENCY !!", " HELP IS COMING ");
            buzzer_emergency();
            notify("EMERGENCY!!");

            /*
             * Auto-reset after 10 seconds
             * Buzzer sounds twice more during countdown
             * then system returns to IDLE so user can re-enter
             */
            DELAY_MS(3000);
            buzzer_emergency();         /* second alert               */
            DELAY_MS(3000);
            buzzer_emergency();         /* third alert                */
            DELAY_MS(2000);

            /* Countdown on LCD */
            lcd_show("EMERGENCY RESET ", "RESTARTING...   ");
            notify("EMERGENCY:AUTO RESET");
            DELAY_MS(2000);

            /* Reset to IDLE */
            gymState      = STATE_IDLE;
            modeConfirmed = 0;
            currentMode   = MODE_CARDIO;
            sessionSeconds = 0;

            LCD_setCursor(0, 0); lcd_print_padded("  SYSTEM RESET  ");
            lcd_show_temp_idle(lastTempC);
            notify("SYSTEM:READY|PRESS ENTRY");
        }

        /* ENTRY */
        else if (entryFlag)
        {
            entryFlag = 0;
            if (gymState == STATE_IDLE)
            {
                gymState      = STATE_MODE_SELECT;
                modeConfirmed = 0;
                currentMode   = MODE_CARDIO;
                buzzer_entry();
                lcd_show_mode_select(currentMode);
                notify("ENTRY|IN_GYM");
            }
            else { notify("ENTRY:IGNORED"); }
        }

