Suprita1801/MSP430---1142/Final Project/smartgym_complete.c
        /* EXIT */
        else if (exitFlag)
        {
            exitFlag = 0;
            if (gymState == STATE_MODE_SELECT ||
                gymState == STATE_ACTIVE      ||
                gymState == STATE_WARNING     ||
                gymState == STATE_REST)
            {
                reset_to_idle();
                buzzer_exit();
                LCD_setCursor(0, 0); lcd_print_padded("  GYM IS FREE   ");
                lcd_show_temp_idle(lastTempC);
                notify("EXIT|IDLE");
            }
            else { notify("EXIT:IGNORED"); }
        }

        /* MODE */
        else if (modeFlag)
        {
            modeFlag = 0;
            if (gymState == STATE_MODE_SELECT && !modeConfirmed)
            {
                currentMode = (currentMode + 1) % 3;
                buzzer_mode();
                lcd_show_mode_select(currentMode);
                switch (currentMode)
                {
                    case MODE_CARDIO: notify("MODE:CARDIO"); break;
                    case MODE_UPPER:  notify("MODE:UPPER");  break;
                    case MODE_LOWER:  notify("MODE:LOWER");  break;
                }
            }
            else { notify("MODE:IGNORED"); }
        }

        /* CONFIRM */
        else if (confirmFlag)
        {
            confirmFlag = 0;
            if (gymState == STATE_MODE_SELECT && !modeConfirmed)
            {
                modeConfirmed = 1;

                LCD_setCursor(0, 0); lcd_print_padded("MODE CONFIRMED! ");
                LCD_setCursor(0, 1);
                switch (currentMode)
                {
                    case MODE_CARDIO: lcd_print_padded("  CARDIO 20 MIN "); break;
                    case MODE_UPPER:  lcd_print_padded(" UPPER 5+5=10MIN"); break;
                    case MODE_LOWER:  lcd_print_padded(" LOWER 5+5=10MIN"); break;
                }

                buzzer_confirm();
                DELAY_MS(1000);
                session_start(currentMode);
            }
            else { notify("CONFIRM:IGNORED"); }
        }

        __bis_SR_register(LPM0_bits);
    }
}

/* ════════════════════════════════════════════════════
 *  TIMER A0 ISR — every 25ms → software count to 1s
 * ════════════════════════════════════════════════════ */
#pragma vector = TIMER0_A0_VECTOR
__interrupt void Timer_A0_ISR(void)
{
    timerSubTick++;
    if (timerSubTick >= TICKS_PER_SEC)
    {
        timerSubTick = 0;
        timerTick    = 1;
        __bic_SR_register_on_exit(LPM0_bits);
    }
}

/* ════════════════════════════════════════════════════
 *  PORT 1 ISR — Entry (P1.3) + Exit (P1.4)
 * ════════════════════════════════════════════════════ */
#pragma vector = PORT1_VECTOR
__interrupt void Port1_ISR(void)
{
    __delay_cycles(DEBOUNCE);

    if (P1IFG & BTN_ENTRY)
    {
        if (!(P1IN & BTN_ENTRY)) { entryFlag = 1; __bic_SR_register_on_exit(LPM0_bits); }
        P1IFG &= ~BTN_ENTRY;
    }
    if (P1IFG & BTN_EXIT)
    {
        if (P1IN & BTN_EXIT)     { exitFlag  = 1; __bic_SR_register_on_exit(LPM0_bits); }
        P1IFG &= ~BTN_EXIT;
    }
}

/* ════════════════════════════════════════════════════
 *  PORT 2 ISR — Mode + Confirm + Emergency
 * ════════════════════════════════════════════════════ */
#pragma vector = PORT2_VECTOR
__interrupt void Port2_ISR(void)
{
    __delay_cycles(DEBOUNCE);

    if (P2IFG & BTN_MODE)
    {
        if (!(P2IN & BTN_MODE))      { modeFlag      = 1; __bic_SR_register_on_exit(LPM0_bits); }
        P2IFG &= ~BTN_MODE;
    }
    if (P2IFG & BTN_CONFIRM)
    {
        if (!(P2IN & BTN_CONFIRM))   { confirmFlag   = 1; __bic_SR_register_on_exit(LPM0_bits); }
        P2IFG &= ~BTN_CONFIRM;
    }
    if (P2IFG & BTN_EMERGENCY)
    {
        if (!(P2IN & BTN_EMERGENCY)) { emergencyFlag = 1; __bic_SR_register_on_exit(LPM0_bits); }
        P2IFG &= ~BTN_EMERGENCY;
    }
}
